<!DOCTYPE html>
<html lang="en">

<head>
    <meta charset="UTF-8">
    <meta name="viewport" content="width=device-width, initial-scale=1.0">
    <title>Document</title>
</head>

<body>
    <?php
    /* 
    Data mapper - Это посредник между двух направленной передачей данных
    между постоянным хранилещем данных и представления данных в памяти 
    (объект - domain слой)

    Какую проблему решает
    1) Устранить объектно реляционный разрыв или
    сделать не зависимым слой домэйн от базы данных

    Держит представление данных в памяти и постоянное хранилище данных
    независимо друг от друга и от самого преобразователя данных

    Соответсвует принципу Solid именно первому правилу S
    Преимущества Data Mapper-а

    Каждый объект имеет свою зону ответственности, тем самым следую принципам SOLID и сохраняя каждый объект простым и по существу.
    Бизнес-логика и сохранение данных связаны слабо, и если вы хотите сохранять данные в XML-файл или какой-нибудь другой формат, 
    вы можете просто написать новый Mapper, не притрагиваясь к доменному объекту.

    Недостатки Data Mapper-а

    Вам придется гораздо больше думать, перед тем как написать код.
    В итоге у вас больше объектов в управлении, что немного усложняет код и его отладку.
    
    
    */

    ?>
</body>

</html>