<!DOCTYPE html>
<html lang="en">

<head>
    <meta charset="UTF-8">
    <meta name="viewport" content="width=device-width, initial-scale=1.0">
    <title>Document</title>
</head>

<body>
    <!-- 
    Модели предназначены для хранения вашей центральной логики бизнес-данных
    Единственная задача «Модели » - обработка данных в постоянном хранилище, поиск и подготовка данных, передаваемых другим составляющим MVC
    Их следует размещать в папке /project/models/.
    Модели обычно именуются в единственном числе и с приставкой "Model" в конце или в начале имени.


    -->
</body>

</html>