/* 
Главные концепции Vue
Реактивность
Реактивность означает, 
что представление в модели MVC изменяется по мере изменения модели. 
В Vue разработчики просто привязывают представление к соответствующей модели,
и Vue автоматически наблюдает за изменениями в модели и перерисовывает представление.
Эта функция делает управление состоянием Vue довольно простым и интуитивно понятным.

Эффекты перехода
Vue предоставляет различные способы применения эффектов перехода при вставке, обновлении или удалении DOM. Включает следующие инструменты：

Автоматически применять CSS классы при переходах и анимации
Вы можете работать со сторонними библиотеками анимации CSS, такими как Animate.css.
Используйте JavaScript функции для перехвата перехода, чтобы напрямую управлять DOM
Может использоваться в сочетании со сторонними библиотеками анимации JavaScript, такими как Velocity.js.

Компоненты/Components
Функциональность экземпляров может быть расширена с помощью компонентов,
хранятся в древовидном виде. Компоненты отличаются от экземпляров тем, что они не привязаны к узлам HTML,
а содержат собственный шаблон HTML.

*/